Revit 2027 API
EnergyAnalysisDetailModel.ExportCategory Property
 Export elements of this category in energy analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ExportCategory { get; set; }
Public Property ExportCategory As ElementId
	Get
	Set
public:
property ElementId^ ExportCategory {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ExportCategory : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 Export will be based on the space type associated with the product creating it. Valid categories are Rooms or MEP Spaces.
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace